from nlp_engine import analyze_word_details

def cut_my_poem(poem_text):
    result = analyze_word_details(poem_text)
    print(result)
    return result
poem_1 = """ถึงโรงเหล้าเตากลั่นควันโขมง        มีคันโพงผูกสายไว้ปลายเสา
โอ้บาปกรรมน้ำนรกเจียวอกเรา     ให้มัวเมาเหมือนหนึ่งบ้าเป็นน่าอาย
ทำบุญบวชกรวดน้ำขอสำเร็จ         พระสรรเพชญโพธิญาณประมาณหมาย
ถึงสุราพารอดไม่วอดวาย               ไม่ใกล้กรายแกล้งเมินก็เกินไป"""

poem_2 = """ดั่งนานนับกัปกัลป์ได้ฝันถึง      คืนวันซึ่งซึ้งละมุนอบอุ่นเหมือน
ความสุขอันผ่านมาแล้วพร่าเลือน   สัมผัสเตือนตาหลับกับภวังค์"""

print("--- ผลลัพธ์กลอนบทที่ 2 (รอบแรก) ---") 
cut_my_poem(poem_2)
